$(window).load(function(){
    //loadBG();
    fPlay();
});


$(function(){
    //setTimeout("fPlay()",500);
    /*歌曲列表效果*/
    $(".songList").hover(function(){
        $(this).find(".more").show();
        $(this).find(".dele").show();
    },function(){
        $(this).find(".more").hide();
        $(this).find(".dele").hide();
    });
    /*自定义滚动条*/
    $(".songUL").rollbar({zIndex:80});
    //$("#lyr").rollbar({zIndex:80});
    /*复选框*/
    $(".checkIn").click(function(){
        var s=$(this).attr("select");
        if (s==0) {
            $(this).css("background-position","-37px -710px");
            $(this).attr("select","1");
        };
        if (s==1) {
            $(this).css("background-position","");
            $(this).attr("select","0");
        };
    });
    $(".checkAll").click(function(){
        var s=$(this).attr("select");
        if (s==0) {
            $(this).css("background-position","-37px -710px");
            $(".checkIn[select='0']").css("background-position","-37px -710px");
            $(".checkIn[select='0']").attr("select","1");
            $(this).attr("select","1");
        };
        if (s==1) {
            $(this).css("background-position","");
            $(".checkIn[select='1']").css("background-position","");
            $(".checkIn[select='1']").attr("select","0");
            $(this).attr("select","0");
        };

    });

    /*  	$.getJSON("<s:url action='historysongs'></s:url>",
          {
              songIndex:songIndex
          },
          function(data) {
              //啥也不做

          }
      );
*/



    /*点击列表播放按钮*/
    $(".start em").click(function(){
        /*开始放歌*/
        var sid=$(this).attr("sonN");


        sid2=$(this).attr("sonN");
        $(".songName").attr("singID",sid);

        var loveN = $(this).parent().parent().find(".love").attr("loveN");
        /*  alert(loveN);*/
        if(loveN==1){
            /*  alert("已收藏");*/
            $(".tc1").css("background-position","0 -131px");
        }else{
            /* alert("取消收藏");*/
            $(".tc1").css("background-position","0 -241px");
        }


        songIndex=sid;
        /*  alert('{"songIndex":"'+songIndex+'"}');*/
        $.ajax({
            contentType: "application/x-www-form-urlencoded",
            type: "POST",
            url: 'songsIndex.action',
            /*  data:'{"songIndex":'+songIndex+'}',*/
            data:{songIndex:songIndex},
            success: function (data) {
                console.log(data);

            }
        });

        $("#audio").attr("src",'songs/'+sid+'.mp3');
        audio=document.getElementById("audio");//获得音频元素
        /*显示歌曲总长度*/
        if(audio.paused){
            audio.play();
        }
        else
            audio.pause();
        audio.addEventListener('timeupdate',updateProgress,false);

        audio.addEventListener('play',audioPlay,false);
        audio.addEventListener('pause',audioPause,false);
        audio.addEventListener('ended',audioEnded,false);
        /*播放歌词*/
        getReady(sid);//准备播放
        mPlay();//显示歌词
        //对audio元素监听pause事件
        /*外观改变*/
        var html="";
        html+='<div class="manyou">';
        html+='	<a href="#" class="manyouA">漫游相似歌曲</a>';
        html+='</div>';
        $(".start em").css({
            "background":"",
            "color":""
        });
        $(".manyou").remove();
        $(".songList").css("background-color","#f5f5f5");
        $(this).css({
            "background":'url("css/images/T1X4JEFq8qXXXaYEA_-11-12.gif") no-repeat',
            "color":"transparent"
        });
        $(this).parent().parent().parent().append(html);
        $(this).parent().parent().parent().css("background-color","#f0f0f0");

        /*底部显示歌曲信息*/
        var songName=$(this).parent().parent().find(".colsn").html();
        var singerName =$(this).parent().parent().find(".colcn").html();
        $(".songName").html(songName);
        $(".songPlayer").html(singerName);
        /*换右侧图片*/
        $("#canvas1").attr("src",'http://localhost:8080/images/'+sid+'.jpg');
        $("#canvas1").load(function(){
            loadBG();
        });
        //setTimeout('loadBG()',100);
        $(".blur").css("opacity","0");
        $(".blur").animate({opacity:"1"},1000);

    });
    /*双击播放*/
    $(".songList").dblclick(function(){
        var sid = $(this).find(".start em").html();
        $(".start em[sonN="+sid+"]").click();
    });
    /*底部进度条控制*/
    $( ".dian" ).draggable({
        containment:".pro2",
        drag: function() {
            var l=$(".dian").css("left");
            var le = parseInt(l);
            audio.currentTime = audio.duration*(le/678);
        }
    });
    /*音量控制*/
    $( ".dian2" ).draggable({
        containment:".volControl",
        drag: function() {
            var l=$(".dian2").css("left");
            var le = parseInt(l);
            audio.volume=(le/80);
        }
    });
    /*底部播放按钮*/
    $(".playBtn").click(function(){
        var p = $(this).attr("isplay");
        if (p==0) {
            $(this).css("background-position","0 -30px");
            $(this).attr("isplay","1");
        };
        if (p==1) {
            $(this).css("background-position","");
            $(this).attr("isplay","0");
        };
        if(audio.paused)
            audio.play();
        else
            audio.pause();

    });
    $(".mode").click(function(){
        // var t = calcTime(Math.floor(audio.currentTime))+'/'+calcTime(Math.floor(audio.duration));
        // //alert(t);
        // var p =Math.floor(audio.currentTime)/Math.floor(audio.duration);
        // alert(p);
        //alert(lytext[1]);
    });
    /*切歌*/
    $(".prevBtn").click(function(){
        var sid = parseInt(songIndex)-1;
        $(".start em[sonN="+sid+"]").click();
    });
    $(".nextBtn").click(function(){
        var sid = parseInt(songIndex)+1;
        $(".start em[sonN="+sid+"]").click();
    });

});


/*首尾模糊效果*/
function loadBG(){
    //alert();
    // stackBlurImage('canvas1', 'canvas', 60, false);
    var c=document.getElementById("canvas");
    var ctx=c.getContext("2d");
    var img=document.getElementById("canvas1");
    ctx.drawImage(img,45,45,139,115,0,0,1366,700);
    stackBlurCanvasRGBA('canvas',0,0,1366,700,60);

}

//喜爱音乐添加
function addLoveMusic(sid){
    $.ajax({
        url : "addCollectionhistorySongs.action",
        type: "post",
        /* async:false,*///(默认: true) 默认设置下，所有请求均为异步请求。如果需要发送同步请求，请将此选项设置为 false。注意，同步请求将锁住浏览器，用户其它操作必须等待请求完成才可以执行。
        contentType:"application/x-www-form-urlencoded",
        data: {id:sid},
        /* type:3,*/

        success: function(data){
        }
    });
}


//音乐从列表删除
function moveMusic(sid){
    //alert("运行"+"sid:"+sid+"   "+type)
    $.ajax({
        url : "deleteSongs.action",
        type: "post",
        /* async:false,*///(默认: true) 默认设置下，所有请求均为异步请求。如果需要发送同步请求，请将此选项设置为 false。注意，同步请求将锁住浏览器，用户其它操作必须等待请求完成才可以执行。
        contentType:"application/x-www-form-urlencoded",
        data: {id:sid},
        success: function(data){
        }

    });
}



$(function () {
    $(".dele").click(function () {
            var sid = $(this).parent().parent().find(".start em").attr("sonN");

            moveMusic(sid);
            /*window.location.reload();*/
            /* location.reload([true]);*/
            /*js中的页面跳转，执行操作后定义到指定的后续步骤中*/
            window.location.href = "deleteSongs.action";

        }

    )
})



$(function() {

    //我喜爱的音乐，小红心系列操作
    $(".love").click(function () {
        var loveN = $(this).attr("loveN");
        var sid = $(this).parent().parent().find(".start em").attr("sonN");




        if (loveN == 0) {

            $(this).css("background-position", "0 -131px");
            $(this).attr("loveN", "1");
            $(".tc1").css("background-position", "0 -131px");

            addLoveMusic(sid);//添加到我喜爱的音乐列表
        }

        if (loveN == 1) {

            //删除我喜爱音乐的歌曲

            moveMusic(sid); //从我喜爱的音乐列表中删除

            $(this).css("background-position", "-28px -130px");
            $(this).attr("loveN", "0");
            $(".tc1").css("background-position", "0 -241px");


        }


        ;
    });
});











function calcTime(time){
    var hour;         	var minute;    	var second;
    hour = String ( parseInt ( time / 3600 , 10 ));
    if (hour.length ==1 )   hour='0'+hour;
    minute=String(parseInt((time%3600)/60,10));
    if(minute.length==1) minute='0'+minute;
    second=String(parseInt(time%60,10));
    if(second.length==1)second='0'+second;
    return minute+":"+second;
}



function updateProgress(ev){
    /*显示歌曲总长度*/
    var songTime = calcTime(Math.floor(audio.duration));
    $(".duration").html(songTime);
    /*显示歌曲当前时间*/
    var curTime = calcTime(Math.floor(audio.currentTime));
    $(".position").html(curTime);
    /*进度条*/
    var lef = 678*(Math.floor(audio.currentTime)/Math.floor(audio.duration));
    var llef = Math.floor(lef).toString()+"px";
    $(".dian").css("left",llef);
}
function audioPlay(ev){
    $(".iplay").css("background",'url("css/images/T1oHFEFwGeXXXYdLba-18-18.gif") 0 0');
    $(".playBtn").css("background-position","0 -30px");
    $(".playBtn").attr("isplay","1");
}
function audioPause(ev){
    $(".iplay").css("background","");
    // $(".start em").css({
    // 	"background":'url("css/images/pause.png") no-repeat 50% 50%',
    // 	"color":"transparent"
    // });
}
function audioEnded(ev){
    var sid = parseInt(songIndex)+1;
    $(".start em[sonN="+sid+"]").click();
}


/*显示歌词部分*/
var scrollt=0; var tflag=0;//存放时间和歌词的数组的下标
var lytext=new Array();//放存汉字的歌词
var lytime=new Array();//存放时间
var delay=10; var line=0; var scrollh=0;
var songIndex=0;
function getLy(s)//取得歌词
{
    var ly="";
    var ly="";
    if(s=="1") {
        ly=".[00:00] 漂洋过海来看你 .[00:02] 演唱：刘明湘.[00:04] 词曲：李宗盛.[00:08] 歌词编辑：丁仔.[00:15] 中文歌词库 www.dingzai.com.[00:21] 为你我用了半年的积蓄.[00:24] 飘洋过海的来看你.[00:29] 为了这次相聚.[00:31] 我连见面时的呼吸 都曾反复练习.[00:36] .[00:38] 言语从来没能将我的情意.[00:42] 表达千万分之一.[00:47] 为了这个遗憾 我在夜里想了又想.[00:51] 不肯睡去.[00:54] .[00:55] 记忆它总是慢慢的累积.[00:59] 在我心中无法抹去.[01:04] 为了你的承诺.[01:05] 我在最绝望的时候 都忍着不哭泣.[01:13] .[01:14] 陌生的城市啊 熟悉的角落里.[01:23] 也曾彼此安慰 也曾相拥叹息.[01:26] 不管将会面对什么样的结局.[01:30] .[01:31] 在漫天风沙里望着你远去.[01:35] 我竟悲伤的不能自已.[01:39] 多盼能送君千里 直到山穷水尽.[01:44] 一生和你相依.[01:49] .[02:07] 陌生的城市啊 熟悉的角落里.[02:15] 也曾彼此安慰 也曾相拥叹息.[02:19] 不管将会面对什么样的结局.[02:23] .[02:23] 在漫天风沙里望着你远去.[02:27] 我竟悲伤的不能自已.[02:32] 多盼能送君千里 直到山穷水尽.[02:36] 一生和你相依.[02:42] .[02:43] 多盼能送君千里 直到山穷水尽.[02:50] 一生和你相依";
    };
    if(s=="2") {
        ly=".[00:00:61]光年之外 - G:E:M:邓紫棋 .[00:00:90]词曲： G:E:M: 邓紫棋.[00:01:20]编曲： Lupo Groinig.[00:01:51]监制： Lupo Groinig.[00:12:30]感受停在我发端的指尖.[00:16:35]如何瞬间  冻结时间.[00:23:02]记住望着我坚定的双眼.[00:27:06]也许已经  没有明天.[00:33:69]面对浩瀚的星海.[00:36:26]我们微小得像尘埃.[00:38:64]漂浮在  一片无奈 .[00:44:57]缘份让我们相遇乱世以外.[00:50:04]命运却要我们危难中相爱.[00:55:45]也许未来遥远在光年之外.[01:00:91]我愿守候未知里为你等待.[01:04:90]我没想到  为了你  我能疯狂到.[01:10:54]山崩海啸  没有你  根本不想逃.[01:15:80]我的大脑  为了你  已经疯狂到  .[01:21:43]脉搏心跳  没有你  根本不重要.[01:28:57]一双围在我胸口的臂弯.[01:32:83]足够抵挡  天旋地转.[01:39:38]一种执迷不放手的倔强.[01:43:51]足以点燃  所有希望.[01:50:04]宇宙磅礡而冷漠.[01:52:64]我们的爱微小却闪烁.[01:55:13]颠簸  却如此忘我.[02:00:89]缘份让我们相遇乱世以外.[02:06:34]命运却要我们危难中相爱.[02:11:74]也许未来遥远在光年之外.[02:17:17]我愿守候未知里为你等待.[02:21:17]我没想到  为了你  我能疯狂到.[02:26:79]山崩海啸 没有你  根本不想逃.[02:32:17]我的大脑  为了你  已经疯狂到.[02:37:64]脉搏心跳  没有你  根本不重要.[02:43:79]也许航道以外  是醒不来的梦.[02:56:24]乱世以外  是纯粹的相拥.[03:05:00]我没想到  为了你  我能疯狂到.[03:10:50]山崩海啸 没有你  根本不想逃.[03:15:80]我的大脑  为了你  已经疯狂到  .[03:21:24]脉搏心跳  没有你  根本不重要.[03:27:24]相遇乱世以外 危难中相爱.[03:38:32]相遇乱世以外 危难中相爱.[03:48:55]我没想到.[03:50:12]";
    };
    if(s=="3"){
        ly=".[00:00:00]GALA-追梦赤子心.[00:04:57].[00:15:33]充满鲜花的世界到底在哪里.[00:21:31]如果它真的存在那么我一定会去.[00:28:76]我想在那里最高的山峰矗立.[00:34:18]不在乎它是不是悬崖峭壁.[00:38:87].[00:42:01]用力活着用力爱哪怕肝脑涂地.[00:47:83]不求任何人满意只要对得起自己.[00:55:20]关于理想我从来没选择放弃.[01:00:66]即使在灰头土脸的日子里.[01:06:44].[01:07:39]也许我没有天分.[01:10:60]但我有梦的天真.[01:13:90]我将会去证明用我的一生.[01:20:64]也许我手比脚笨.[01:23:85]但我愿不停探寻.[01:27:26]付出所有的青春不留遗憾.[01:32:69].[01:34:61]向前跑 迎着冷眼和嘲笑.[01:40:16]生命的广阔不历经磨难怎能感到.[01:47:13]命运它无法让我们跪地求饶.[01:54:71]就算鲜血洒满了怀抱.[01:59:62].[02:00:98]继续跑 带着赤子的骄傲.[02:07:69]生命的闪耀不坚持到底怎能看到.[02:14:02]与其苟延残喘不如纵情燃烧吧.[02:22:16]有一天会再发芽.[02:29:03].[02:55:66]未来迷人绚烂总在向我召唤.[03:00:58]哪怕只有痛苦作伴也要勇往直前.[03:08:47]我想在那里最蓝的大海扬帆.[03:14:18]绝不管自己能不能回还.[03:19:62].[03:20:99]失败后郁郁寡欢.[03:23:86]那是懦夫的表现.[03:27:29]只要一息尚存请握紧双拳.[03:34:11]在天色破晓之前.[03:37:27]我们要更加勇敢.[03:40:74]等待日出时最耀眼的瞬间.[03:46:07].[03:47:77]向前跑 迎着冷眼和嘲笑.[03:54:10]生命的广阔不历经磨难怎能感到.[04:01:11]命运它无法让我们跪地求饶.[04:08:03]就算鲜血洒满了怀抱.[04:12:44].[04:14:31]继续跑 带着赤子的骄傲.[04:20:92]生命的闪耀不坚持到底怎能看到.[04:27:37]与其苟延残喘不如纵情燃烧.[04:35:17]为了心中的美好.[04:42:18]不妥协直到变老.[04:48:66]";
    };
    if(s=="4"){
        ly=".[00:03:18]海阔天空-Beyond.[00:19:10]今天我 寒夜里看雪飘过.[00:25:14]怀着冷却了的心窝飘远方.[00:31:18]风雨里追赶 雾里分不清影踪.[00:37:32]天空海阔你与我 可会变.[00:43:78]多少次迎着冷眼与嘲笑.[00:50:10]从没有放弃过心中的理想.[00:56:06]一刹那恍惚 若有所失的感觉.[01:02:20]不知不觉已变淡 心里爱.[01:09:17]原谅我这一生不羁放纵爱自由.[01:16:05]也会怕有一天会跌倒.[01:22:17]背弃了理想谁人都可以.[01:28:27]哪会怕有一天只你共我.[01:43:34]今天我 寒夜里看雪飘过.[01:49:54]怀着冷却了的心窝飘远方.[01:55:46]风雨里追赶 雾里分不清影踪.[02:01:52]天空海阔你与我 可会变.[02:08:46]原谅我这一生不羁放纵爱自由.[02:15:28]也会怕有一天会跌倒.[02:21:58]背弃了理想谁人都可以.[02:27:77]哪会怕有一天只你共我.[02:39:27]仍然自由自我.[02:40:98]永远高唱我歌.[02:44:22]走遍千里 原谅我这一生不羁放纵爱自由.[02:55:79]也会怕有一天会跌倒.[03:02:05]背弃了理想 谁人都可以.[03:08:22]哪会怕有一天只你共我.[03:13:39]原谅我这一生不羁放纵爱自由.[03:20:65]也会怕有一天会跌倒.[03:26:70]背弃了理想谁人都可以.[03:33:25]哪会怕有一天只你共我";
    };
    if(s=="5"){
        ly=".[00:00:41]温柔 - 五月天.[00:50:41]走在风中今天阳光 突然好温柔.[00:57:83]天的温柔 地的温柔 像你抱着我.[01:05:04]然后发现你的改变 孤单的今后.[01:11:38]如果冷 该怎么度过.[01:23:37]天边风光身边的我 都不在你眼中.[01:30:28]你的眼中藏着什么 我从来都不懂.[01:37:41]没有关系你的世界 就让你拥有.[01:43:62]不打扰 是我的温柔.[01:54:71]不知道不明了不想要 为什么我的心.[02:02:01]明明是想靠近 却孤单的黎明.[02:08:98]不知道不        明了不想要 为什么我的心.[02:16:25]那爱情的绮丽 总是在孤单里.[02:23:17]再把我的最好的爱给你.[02:30:71]不知不觉不情不愿 又到巷子口.[02:37:84]我没有哭也没有笑 因为这是梦.[02:44:76]没有预兆没有理由 你真的有说过.[02:50:91]如果有 就让你自由.[04:44:59]不知道不明了不想要 为什么我的心.[04:51:54]明明是想靠近 却孤单的黎明.[04:58:32]不知道不明了不想要 为什么我的心.[05:05:31]那爱情的绮丽 总是在孤单里.[05:11:98]再把我的最好的爱给你.[05:19:40]不知不觉不情不愿 又到巷子口.[05:26:28]我没有哭也没有笑 因为这是梦.[05:33:07]没有预兆没有理由 你真的有说过.[05:39:19]如果有 就让你自由.[05:54:57]自由…….[05:59:93]这是我的温柔 这是我的温柔 这是我的温柔.[06:10:29]这是我的……温柔.[06:26:14]就让你自由……";
    };
    if(s=="6"){
        ly=".[00:00:74]刚好遇见你.[00:03:04].[00:04:63]作词：高进.[00:06:17]作曲：高进.[00:07:71]编曲：关天天.[00:09:25]演唱：李玉刚.[00:11:15].[00:13:02]我们哭了.[00:15:89]我们笑着.[00:19:06]我们抬头望天空.[00:22:12]星星还亮着几颗.[00:25:30]我们唱着.[00:28:36]时间的歌.[00:31:37]才懂得相互拥抱.[00:34:45]到底是为了什么.[00:37:14].[00:37:41]因为我刚好遇见你.[00:40:93]留下足迹才美丽.[00:44:03]风吹花落泪如雨.[00:47:16]因为不想分离.[00:49:77].[00:50:20]因为刚好遇见你.[00:53:26]留下十年的期许.[00:56:25]如果再相遇.[00:59:57]我想我会记得你.[01:03:30].[01:14:46]我们哭了.[01:17:53]我们笑着.[01:20:66]我们抬头望天空.[01:23:66]星星还亮着几颗.[01:26:82]我们唱着.[01:29:90]时间的歌.[01:32:96]才懂得相互拥抱.[01:36:00]到底是为了什么.[01:38:83].[01:39:14]因为我刚好遇见你.[01:42:52]留下足迹才美丽.[01:45:75]风吹花落泪如雨.[01:48:75]因为不想分离.[01:51:27].[01:51:74]因为刚好遇见你.[01:54:92]留下十年的期许.[01:57:98]如果再相遇Z.[02:01:08]我想我会记得你.[02:04:22]因为我刚好遇见你.[02:07:23]留下足迹才美丽.[02:10:42]风吹花落泪如雨.[02:13:40]因为不想分离.[02:15:94].[02:16:67]因为刚好遇见你.[02:19:42]留下十年的期许.[02:22:50]如果再相遇.[02:25:63]我想我会记得你.[02:29:44].[02:31:45]因为我刚好遇见你.[02:34:79]留下足迹才美丽.[02:37:95]风吹花落泪如雨.[02:41:03]因为不想分离.[02:43:94].[02:44:33]因为刚好遇见你.[02:47:10]留下十年的期许.[02:50:27]如果再相遇.[02:53:48]我想我会记得你.[03:10:54]";
    };
    if(s=="7"){
        ly=".[00:00:83]Always Online - 林俊杰.[00:17:27]变色的生活.[00:18:85]任性的挑拨.[00:20:97]疯狂的冒出了头.[00:25:31]短短的守候.[00:27:12]是他的温柔.[00:28:97]还是少了点什么.[00:33:08]遥远两端爱挂在天空飞.[00:37:17]风停了也无所谓.[00:40:72]只因为你曾说.[00:43:23]Everything will be okay.[00:47:81]我准备好了.[00:49:07]Three two one.[00:50:86]I'm always online.[00:52:44]和你 one to one.[00:54:39]爱开始扩散.[00:56:55]我们连接了穿越天空银河 oh oh.[01:04:17]开始倒数.[01:05:00]Three two one.[01:06:21]删除我的孤单.[01:08:40]More and more 尽是深刻.[01:13:32]爱亮了 爱笑了.[01:15:45]I'm always online.[01:21:42]变色的生活.[01:23:13]任性的挑拨.[01:24:91]疯狂的冒出了头.[01:29:44]短短的守候.[01:30:83]是他的温柔.[01:32:66]却还是少了点什么.[01:37:15]遥远两端爱挂在天空飞.[01:40:92]风停了也无所谓.[01:44:53]只因为你曾说.[01:46:62]Everything will be okay.[01:52:08]我准备好了.[01:53:10]Three two one.[01:54:66]I'm always online.[01:56:54]和你 one to one.[01:58:43]爱开始扩散.[02:00:35]我们连接了穿越天空银河 oh oh.[02:07:98]开始倒数.[02:08:94]Three two one.[02:10:32]删除我的孤单.[02:12:28]More and more 尽是深刻.[02:17:36]爱亮了 爱笑了.[02:19:42]I'm always online.[02:41:93]我准备好了.[02:42:96]Three two one.[02:44:63]I'm always online.[02:46:51]和你 one to one.[02:48:45]爱开始扩散.[02:50:34]我们连接了穿越天空银河.[02:57:96]开始倒数.[02:58:78]Three two one.[03:02:62]删除我的孤单.[03:03:71]More and more 尽是深刻.[03:07:27]爱亮了 爱笑了.[03:09:18]I'm always online.[03:15:43]爱亮了 爱笑了.[03:17:54]I'm always online";
    };
    if(s=="8"){
        ly=".[00:00:85]爱不会绝迹.[00:08:43]作词：王雅君 作曲：林俊杰.[00:10:26]演唱：林俊杰.[00:11:96].[00:21:68]我站在世界的屋顶.[00:28:21]用放大镜看天地.[00:34:37]发现太多的神奇.[00:38:04]一起去寻觅 未知的命运.[00:45:08].[00:48:43]宁愿相信爱永不会绝迹.[00:52:03]谁能抹去那些古老传奇.[00:55:12]我们手握紧 勇气和信心 就能够无敌.[01:00:56].[01:01:44]渴望每个明天绝不放弃.[01:04:63]努力燃烧用不完的活力.[01:07:81]幻想的天地 揭开了奥秘 心跳永不暂停.[01:14:99].[01:43:67]我预言下一秒危机.[01:50:26]有你就不怕荆棘.[01:56:59]并肩创造的奇迹.[02:00:12]都记在心底 友情和恒星.[02:07:01].[02:07:69]宁愿相信爱永不会绝迹.[02:10:95]谁能抹去那些古老传奇.[02:14:05]我们手握紧 勇气和信心 就能够无敌 yeah.[02:18:88].[02:20:43]渴望每个明天绝不放弃.[02:23:56]努力燃烧用不完的活力.[02:26:71]幻想的天地 揭开了奥秘 心跳永不暂停.[02:33:86].[02:42:61]不管经过多少难题.[02:45:98]不管穿越多少距离.[02:49:28]心和你 越靠近.[02:52:54]梦想就会更清晰.[02:54:56].[02:55:20]渴望每个明天绝不放弃.[02:58:34]努力燃烧用不完的活力.[03:01:55]幻想的天地 揭开了奥秘 心跳永不暂停.[03:07:17].[03:07:81]宁愿相信爱永不会绝迹.[03:10:92]谁能抹去那些古老传奇.[03:14:10]我们手握紧 勇气和信心.[03:17:11].[03:20:53]渴望每个明天绝不放弃.[03:23:53]努力燃烧用不完的活力.[03:26:82]幻想的天地 揭开了奥秘 心跳永不暂停.[03:33:20]我 始终都相信 爱不会绝迹.[03:41:60]";
    };
    if(s=="9"){
        ly=".[00:01:70]爱笑的眼睛.[00:03:57]演唱：林俊杰.[00:05:80].[00:14:64]如果不是那镜子.[00:16:73]不像你不藏秘密.[00:21:26]我还不肯相信.[00:23:02]没有你我的笑更美丽.[00:28:99]那天听你在电话里略带抱歉的关心.[00:36:03]我嘟的一声切的比你说分手彻底.[00:42:82].[00:43:50]泪湿的衣洗干净阳光里晒干回忆.[00:50:18]折好了伤心明天起只和快乐出去.[00:57:71]这爱的城市虽然拥挤.[01:01:15]如果真的遇见你.[01:04:90]你不必讶异我的笑她无法代替.[01:10:80].[01:12:36]离开你我才发现自己.[01:15:56]那爱笑的眼睛流过泪.[01:20:23]像躲不过的暴风雨.[01:23:95]淋湿的昨天删去(忘记).[01:26:81]离开你我才找回自己.[01:29:95]那爱笑的眼睛再见爱情.[01:34:69]我一定让自己让自己决定.[01:43:22].[01:59:26]泪湿的衣洗干净阳光里晒干回忆.[02:06:20]折好了伤心明天只和快乐出去.[02:13:30]这爱的城市虽然拥挤.[02:16:94]如果真的遇见你.[02:20:72]你不必讶异我的笑她无法代替.[02:26:89].[02:28:04]离开你我才发现自己.[02:31:29]那爱笑的眼睛流过泪.[02:35:99]当一个人看旧电影.[02:39:61]是我不小心而已.[02:42:47]离开你我才找回我自己.[02:45:74]那爱笑的眼睛再见到你.[02:50:62]我一定让自己让自己坚定.[03:00:22].[03:01:04]离开你我才发现自己.[03:03:96]那爱笑的眼睛流过泪.[03:08:53]像躲不过的暴风雨.[03:12:11]淋湿的昨天忘记.[03:15:02]离开你我才找回自己.[03:18:32]那爱笑的眼睛再见爱情.[03:23:22]我一定让自己让自己坚定.[03:31:31].[03:31:93]再见到你.[03:33:89]我一定让自己假装很坚定.[03:45:85]";
    };
    if(s=="10"){
        ly=".[00:02:18]背对背拥抱.[00:04:83]作词：林怡凤 作曲：林俊杰.[00:06:79]演唱：林俊杰.[00:08:47].[00:15:23]话总说不清楚 该怎么明了.[00:22:70]一字一句像圈套.[00:29:90]旧帐总翻不完 谁无理取闹.[00:36:64]你的双手甩开刚好的微妙.[00:42:21]然后战火再燃烧.[00:46:49].[00:48:74]我们背对背拥抱.[00:52:40]滥用沉默在咆哮.[00:56:06]爱情来不及变老.[00:59:07]葬送在烽火的玩笑.[01:02:86].[01:03:51]我们背对背拥抱.[01:07:15]真话兜着圈子乱乱绕.[01:11:06]只是想让我知道.[01:14:94]只是想让你知道 爱的警告.[01:21:00].[01:23:74]话总说不清楚 该怎么明了.[01:30:68]一字一句像圈套.[01:38:22]旧帐总翻不完 谁无理取闹.[01:45:12]你的双手甩开刚好的微妙.[01:50:61]然后战火再燃烧.[01:54:53].[01:55:24]我们背对背拥抱.[01:58:82]滥用沉默在咆哮.[02:02:56]爱情来不及变老.[02:05:53]葬送在烽火的玩笑.[02:09:00].[02:10:71]我们背对背拥抱.[02:13:65]真话兜着圈子乱乱绕.[02:17:46]只是想让我知道.[02:21:23]只是想让你知道 爱的警告.[02:28:13].[02:29:35]我不要一直到 形同陌路变成自找.[02:36:47]既然可以拥抱  就不要轻易放掉.[02:43:67].[02:45:31]我们背对背拥抱.[02:48:74]滥用沉默在咆哮.[02:52:29]爱情来不及变老.[02:55:35]葬送在烽火的玩笑.[02:59:20].[02:59:62]我们背对背拥抱.[03:03:43]真话兜着圈子乱乱绕.[03:07:55]只是想让我知道.[03:11:21]只是想让你知道 这警告.[03:18:56]只是想让我知道.[03:22:14]只是想让你知道 爱的警告.[03:31:21]";
    };
    if(s=="11"){
        ly=".[00:00:71]当你.[00:02:37]作词：张思尔 作曲：林俊杰:.[00:04:47]演唱：林俊杰:.[00:06:43]:.[00:14:70]如果有一天 我回到从前:.[00:20:53]回到最原始的我:.[00:24:91]你是否 会觉得我不错:.[00:29:36]如果有一天 我离你遥远:.[00:34:09]不能再和你相约:.[00:39:22]你是否会发觉 我已经说再见:.[02:52:16]:.[01:52:79]:.[00:45:12]:.[03:21:07]:.[02:52:37]:.[01:54:79]:.[00:46:78]当你的眼睛 瞇着笑 当你喝可乐 当你吵:.[03:27:87]:.[02:59:37]:.[02:01:96]:.[00:53:90]我想对你好 你从来不知道 想你 想你 也能成为嗜好:.[03:06:48]:.[02:09:14]:.[01:01:13]当你说今天的烦恼 当你说夜深 你睡不着:.[03:13:66]:.[02:16:38]:.[01:08:28]我想对你说 却害怕都说错 好喜欢你 知不知道:.[02:26:03]:.[01:17:32]:.[01:23:31]如果有一天 梦想都实现:.[01:28:68]回忆都成了永远 你是否还会 记得今天:.[01:37:43]如果有一天 我们都发觉:.[01:42:28]原来什么都可以 我们是否还会 停留在这里:.[02:29:58]:.[02:38:44]也许空虚 让我想得太多 也许该回到被窝:.[02:45:06]梦里会相遇 就毫不犹豫 大声的说我要说:.[03:34:86]:.[03:35:06]啦 ~ ~ ~ 啦 ~ ~ ~:.[03:42:40]我想对你说 却害怕都说错 好喜欢你 知不知道:.[03:52:21]";
    };
    if(s=="12"){
        ly=".[00:01:25]冻结.[00:03:50]作词：张思尔 作曲：林俊杰.[00:06:33]演唱：林俊杰.[00:08:56].[00:16:21]不小心回到那一天.[00:20:20]不小心一切又重演.[00:24:03]你如此完美的一切.[00:27:93]竟会出现在我的世界.[00:31:73]你说话不爱说第二遍.[00:35:64]但偏在情人节那一夜.[00:39:45]给我你心爱的项链.[00:43:51]说了三次对我的爱恋.[00:48:14]我那时糊涂.[00:50:90]不明白为何你会哭.[00:54:86]后知后觉以后 领悟.[00:59:90].[01:03:30]冻结那时间 .[01:04:55]冻结初遇那一天.[01:07:03]冻结那爱恋.[01:08:52]冻结吻你那瞬间.[01:10:78]我  也会疲倦.[01:14:17]你的项链 在我身边 .[01:15:98]带我穿梭回从前.[01:18:60]冻结那空间 .[01:20:19]冻结有你的世界.[01:22:51]冻结那画面 .[01:23:97]冻结不让它溶解.[01:26:36]我  若是疲倦.[01:29:64]你的项链 在我身边 .[01:31:57]发光在我胸前.[01:33:67]你的项链 在我身边.[01:35:39]陪伴着我过每一天.[01:38:48].[02:13:49]不小心回到那一天.[02:17:38]不小心一切又重演.[02:20:90]你如此完美的一切.[02:24:80]竟会出现在我的世界.[02:28:68]你说话不爱说第二遍.[02:32:60]但偏在情人节那一夜.[02:36:37]给我你心爱的项链.[02:40:42]说了三次对我的爱恋.[02:44:55]我那时糊涂.[02:47:85]不明白为何你会哭.[02:51:60]后知后觉以后 领悟.[02:56:84].[03:00:33]冻结那时间 .[03:01:65]冻结初遇那一天.[03:03:95]冻结那爱恋 .[03:05:45]冻结吻你那瞬间.[03:07:73]我  也会疲倦.[03:11:09]你的项链 在我身边 .[03:12:95]带我穿梭回从前.[03:15:55]冻结那空间 .[03:17:15]冻结有你的世界.[03:19:49]冻结那画面 .[03:21:13]冻结不让它溶解.[03:23:34]我  若是疲倦.[03:26:70]你的项链 在我身边 .[03:28:41]发光在我胸前.[03:30:70]你的项链 在我身边 .[03:32:28]陪伴着我过每一天.[03:35:59].[03:39:24]冻结那时间 .[03:40:63]冻结初遇那一天.[03:42:87]冻结那爱恋 .[03:44:40]冻结吻你那瞬间.[03:46:71]我  也会疲倦.[03:50:05]你的项链 在我身边 .[03:51:86]带我穿梭回从前.[03:54:42]冻结那空间 .[03:56:27]冻结有你的世界.[03:58:44]冻结那画面 .[04:00:02]冻结不让它溶解.[04:02:29]我  若是疲倦.[04:05:63]你的项链 在我身边 .[04:07:43]发光在我胸前.[04:09:71]你的项链 在我身边 .[04:11:27]陪伴着我过每一天.[04:14:76].[04:17:65]你的项链 在我身边 .[04:19:13]发光在我胸前.[04:21:49]你的项链 在我身边 .[04:23:37]陪伴着我过每一天.[04:28:16]";
    };
    if(s=="13"){
        ly=".[00:02:00]江南.[00:04:00]作词：李瑞洵  作曲：林俊杰.[00:06:00]演唱：林俊杰.[00:08:00].[00:35:80]风到这里就是粘.[00:39:16]粘住过客的思念.[00:43:67]雨到了这里缠成线.[00:47:17]缠着我们流连人世间.[00:51:83]你在身边就是缘.[00:55:26]缘分写在三生石上面.[00:59:80]爱有万分之一甜.[01:03:26]宁愿我就葬在这一天.[01:07:89]圈圈圆圆圈圈.[01:11:14]天天年年天天 的我.[01:13:88]深深看你的脸.[01:16:29]生气的温柔  埋怨的温柔 的脸.[01:23:46].[01:24:53]不懂爱恨情愁煎熬的我们.[01:28:02]都以为相爱就像风云的善变.[01:32:11]相信爱一天  抵过永远.[01:36:46]在这一刹那冻结了时间.[01:40:26]不懂怎么表现温柔的我们.[01:44:08]还以为殉情只是古老的传言.[01:47:95]离愁能有多痛  痛有多浓.[01:52:57]当梦被埋在江南烟雨中.[01:55:81]心碎了才懂.[01:59:16].[02:21:38]圈圈圆圆圈圈.[02:23:12]天天年年天天 的我.[02:25:87]深深看你的脸.[02:28:25]生气的温柔  埋怨的温柔 的脸.[02:35:51].[02:36:37]不懂爱恨情愁煎熬的我们.[02:40:08]都以为相爱就像风云的善变.[02:44:07]相信爱一天  抵过永远.[02:48:60]在这一刹那冻结了时间.[02:52:24]不懂怎么表现温柔的我们.[02:56:13]还以为殉情只是古老的传言.[03:00:06]离愁能有多痛  痛有多浓.[03:04:53]当梦被埋在江南烟雨中.[03:07:83]心碎了才懂.[03:11:28].[03:20:38]相信爱一天  抵过永远.[03:24:61]在这一刹那冻结了时间.[03:28:24]不懂怎么表现温柔的我们.[03:32:06]还以为殉情只是古老的传言.[03:36:02]离愁能有多痛  痛有多浓.[03:40:55]当梦被埋在江南烟雨中.[03:45:93]心碎了才懂.[03:49:37]";
    };
    if(s=="14"){
        ly=".[00:01:80]曹操.[00:03:87]作词：林秋离 作曲：林俊杰.[00:06:43]演唱：林俊杰.[00:08:96].[00:27:19]不是英雄 .[00:30:33]不读三国.[00:33:47]若是英雄.[00:36:14]怎么能不懂寂寞.[00:39:55]独自走下长坂坡.[00:41:44]月光太温柔.[00:43:23]曹操不啰嗦.[00:44:93]一心要那荆州.[00:46:93]用阴谋 阳谋.[00:48:49]明说 暗夺淡泊.[00:50:86].[00:53:56]东汉末年分三国.[00:56:61]烽火连天不休.[01:00:15]儿女情长 被乱世左右.[01:05:10]谁来煮酒.[01:06:86]尔虞我诈是三国.[01:09:85]说不清对与错.[01:13:62]纷纷扰扰 千百年以后.[01:18:49]一切又从头.[01:20:94].[01:33:79]不是英雄 不读三国.[01:40:10]若是英雄.[01:42:92]怎么能不懂寂寞.[01:46:28]独自走下长坂坡.[01:48:08]月光太温柔.[01:49:94]曹操不啰嗦.[01:51:55]一心要那荆州.[01:53:49]用阴谋 阳谋.[01:55:15]明说 暗夺淡泊.[01:57:98].[02:00:48]东汉末年分三国.[02:03:28]烽火连天不休.[02:06:91]儿女情长 被乱世左右.[02:11:77]谁来煮酒.[02:13:56]尔虞我诈是三国.[02:16:61]说不清对与错.[02:20:27]纷纷扰扰 千百年以后.[02:25:14]一切又从头.[02:27:58].[02:40:18]独自走下长坂坡.[02:41:54]月光太温柔.[02:43:28]曹操不啰嗦.[02:44:84]一心要那荆州.[02:46:78]用阴谋 阳谋.[02:48:46]明说 暗夺淡泊.[02:50:65].[02:52:73]东汉末年分三国.[02:56:77]烽火连天不休.[03:00:18]儿女情长 被乱世左右.[03:05:17]谁来煮酒.[03:06:90]尔虞我诈是三国.[03:09:90]说不清对与错.[03:13:59]纷纷扰扰 千百年以后.[03:1]喔…….[03:30:81]";
    };
    if(s=="15"){
        ly=".[00:02:00]翅膀.[00:05:00]作词：张思尔 作曲：林俊杰.[00:08:00]演唱：林俊杰.[00:11:00].[00:14:91]同样的机场 不同世界.[00:21:86]同样的咖啡 不同味觉.[00:28:90]同样的我 和我都少了一些.[00:35:98]看飞机划过天空不 见了.[00:41:68].[00:46:40]用你给我的翅膀飞.[00:50:04]我懂这不是伤悲.[00:53:57]再高都不会累.[00:56:49]我们都说好了.[01:00:84]用你给我的翅膀飞.[01:04:32]我感觉己够安慰.[01:07:71]乌云也不再多.[01:10:52]我们也不为谁掉眼泪.[01:15:76].[01:28:79]空气中藏着 你的香味.[01:36:07]回忆里躲着 你的眼泪.[01:42:97]最后拥抱的温暖 还有一些.[01:50:17]我拖著行李往前一 直走.[01:58:11].[02:00:79]用你给我的翅膀飞.[02:04:07]我懂这不是伤悲.[02:07:71]再高都不会累.[02:10:76]我们都说好了.[02:14:74]用你给我的翅膀飞.[02:18:34]我感觉己够安慰.[02:21:85]乌云也不再多.[02:24:61]我们也不为谁掉眼泪.[02:28:84]看一看回忆 是云朵一朵朵地飘过.[02:35:99]若想要回头 就无法翱翔.[02:43:22]用你给我的翅膀飞.[02:46:50]我懂这不是伤悲.[02:50:06]再高都不会累.[02:53:07]我们都说好了.[02:57:19]用你给我的翅膀飞.[03:00:65]我感觉己够安慰.[03:04:20]乌云也不再多.[03:06:84]我们也不为谁掉眼泪.[03:12:44].[03:15:00]乌云也不再多.[03:17:57]我们也不为谁掉眼泪.[03:23:67]";
    };
    return ly;
}
function show(t)//显示歌词
{
    var div1=document.getElementById("lyr");//取得层
    document.getElementById("lyr").innerHTML=" ";//每次调用清空以前的一次
    if(t<lytime[lytime.length-1])//先舍弃数组的最后一个
    {
        for(var k=0;k<lytext.length;k++)
        {
            if(lytime[k]<=t&&t<lytime[k+1])
            { scrollh=k*25;//让当前的滚动条的顶部改变一行的高度
                div1.innerHTML+="<font color=#f60 style=font-weight:bold>"+lytext[k]+"</font><br>";
            }
            else if(t<lytime[lytime.length-1])//数组的最后一个要舍弃
                div1.innerHTML+=lytext[k]+"<br>";
        }
    }
    else//加上数组的最后一个
    {
        for(var j=0;j<lytext.length-1;j++)
            div1.innerHTML+=lytext[j]+"<br>";
        div1.innerHTML+="<font color=red style=font-weight:bold>"+lytext[lytext.length-1]+"</font><br>";
    }
}
function scrollBar()//设置滚动条的滚动
{
    if(document.getElementById("lyr").scrollTop<=scrollh)
        document.getElementById("lyr").scrollTop+=1;
    if(document.getElementById("lyr").scrollTop>=scrollh+50)
        document.getElementById("lyr").scrollTop-=1;
    window.setTimeout("scrollBar()",delay);
}
function getReady(s)//在显示歌词前做好准备工作
{
    var ly=getLy(s);//得到歌词
    //alert(ly);
    // lytext.length=0;
    // lytime.length=0;
    // lytext = new Array();
    // lytime = new Array();
    if (ly=="") {
        $("#lry").html("本歌暂无歌词！");
    };
    var arrly=ly.split(".");//转化成数组
    //alert(arrly[1]);
    tflag=0;
    for( var i=0;i<lytext.length;i++)
    {
        lytext[i]="";
    }
    for( var i=0;i<lytime.length;i++)
    {
        lytime[i]="";
    }
    $("#lry").html(" ");
    document.getElementById("lyr").scrollTop=0;
    for(var i=0;i<arrly.length;i++)
        sToArray(arrly[i]);
    // alert(lytext[2]);
    // alert(lytime[2]);
    sortAr();
    //$("#lyr").html("");
    // for(var j=0;j<lytext.length;j++)
    //   {
    //      document.getElementById("lyr").innerHTML+=lytime[j]+lytext[j]+"<br>";
    //   }
    scrollBar();
}
function sToArray(str)//解析如“[02:02][00:24]没想到是你”的字符串前放入数组
{

    var left=0;//"["的个数
    var leftAr=new Array();
    for(var k=0;k<str.length;k++)
    {
        if(str.charAt(k)=="[") { leftAr[left]=k; left++; }
    }
    if(left!=0)
    {
        for(var i=0;i<leftAr.length;i++)
        {
            lytext[tflag]=str.substring(str.lastIndexOf("]")+1);//放歌词
            lytime[tflag]=conSeconds(str.substring(leftAr[i]+1,leftAr[i]+6));//放时间
            tflag++;
        }
    }
    //alert(str.substring(leftAr[0]+1,leftAr[0]+6));
}
function sortAr()//按时间重新排序时间和歌词的数组
{
    var temp=null; var temp1=null; for(var k=0;k<lytime.length;k++) { for(var j=0;j<lytime.length-k;j++) { if(lytime[j]>lytime[j+1]) { temp=lytime[j]; temp1=lytext[j]; lytime[j]=lytime[j+1]; lytext[j]=lytext[j+1]; lytime[j+1]=temp; lytext[j+1]=temp1; } } }
}
function conSeconds(t)//把形如：01：25的时间转化成秒；
{
    var m=t.substring(0,t.indexOf(":"));
    var s=t.substring(t.indexOf(":")+1);
    m=parseInt(m.replace(/0/,""));
    //if(isNaN(s)) s=0;
    var totalt=parseInt(m)*60+parseInt(s);
    //alert
    // (parseInt(s.replace(//b(0+)/gi,"")));
    //if(isNaN(totalt))  return 0;

    return totalt;
}
// function getSeconds()//得到当前播放器播放位置的时间
// { var t=getPosition(); t=t.toString();//数字转换成字符串
//  var s=t.substring(0,t.lastIndexOf("."));//得到当前的秒
//  //alert(s);
//  return s;
//  }
//  function getPosition()//返回当前播放的时间位置
//   { var mm=document.getElementById("MediaPlayer1");
//    //var mmt=;
//    //alert(mmt);
//    return mm.CurrentPosition;
// }
function mPlay()//开始播放
{
    // var ms=parseInt(getSeconds());
    // if(isNaN(ms)) show(0);
    // else show(ms);
    var ms =audio.currentTime;
    show(ms);
    window.setTimeout("mPlay()",100)
}
function fPlay(){
    $(".start em[sonN="+songIndex+"]").click();


}
//删除对话框
function Confirm(){
    qikoo.dialog2.confirm('确定要删除此歌曲吗？',function(){

    },function(){
        alert("取消啦！");
    });
}

// window.setTimeout("mPlay()",100);
// window.setTimeout("getReady()",100);
// function test()//测试使用，
// { 
// 	alert(lytime[lytime.length-1]); 
// }

// [00:00]漂洋过海来看你 .[00:04]演唱：刘明湘 .[00:08]作词：李宗盛 .[00:12]作曲：李宗盛 .[00:18]为你 我用了半年的积蓄 .[00:21]飘洋过海的来看你 .[00:26]为了这次相聚 .[00:28]我连见面时的呼吸 都曾反复练习 .[00:33] .[00:35]言语从来没能将我的情意 .[00:38]表达千万分之一 .[00:43]为了这个遗憾 我在夜里想了又想 .[00:48]不肯睡去 .[00:51] .[00:52]记忆它总是慢慢的累积 .[00:56]在我心中无法抹去 .[01:00]为了你的承诺 .[01:02]我在最绝望的时候 都忍着不哭泣 .[01:08] .[01:11]陌生的城市啊 熟悉的角落里 .[01:19]也曾彼此安慰 也曾相拥叹息 .[01:23]不管将会面对什么样的结局 .[01:27] .[01:28]在漫天风沙里望着你远去 .[01:31]我竟悲伤的不能自已 .[01:36]多盼能送君千里 直到山穷水尽 .[01:40]一生和你相依 .[01:44] .[02:03]陌生的城市啊 熟悉的角落里 .[02:12]也曾彼此安慰 也曾相拥叹息 .[02:16]不管将会面对什么样的结局 .[02:20] .[02:20]在漫天风沙里望着你远去 .[02:24]我竟悲伤的不能自已 .[02:28]多盼能送君千里 直到山穷水尽 .[02:33]一生和你相依 .[02:36] .[02:39]多盼能送君千里 直到山穷水尽 .[02:47]一生和你相依 .[02:55] 
//[00:00] 漂洋过海来看你.[00:02] 演唱：刘明湘.[00:04] 词曲：李宗盛.[00:08] 歌词编辑：丁仔.[00:15] 中文歌词库 www.dingzai.com.[00:21] 为你我用了半年的积蓄.[00:24] 飘洋过海的来看你.[00:29] 为了这次相聚.[00:31] 我连见面时的呼吸 都曾反复练习.[00:36] .[00:38] 言语从来没能将我的情意.[00:42] 表达千万分之一.[00:47] 为了这个遗憾 我在夜里想了又想.[00:51] 不肯睡去.[00:54] .[00:55] 记忆它总是慢慢的累积.[00:59] 在我心中无法抹去.[01:04] 为了你的承诺.[01:05] 我在最绝望的时候 都忍着不哭泣.[01:13] .[01:14] 陌生的城市啊 熟悉的角落里.[01:23] 也曾彼此安慰 也曾相拥叹息.[01:26] 不管将会面对什么样的结局.[01:30] .[01:31] 在漫天风沙里望着你远去.[01:35] 我竟悲伤的不能自已.[01:39] 多盼能送君千里 直到山穷水尽.[01:44] 一生和你相依.[01:49] .[02:07] 陌生的城市啊 熟悉的角落里.[02:15] 也曾彼此安慰 也曾相拥叹息.[02:19] 不管将会面对什么样的结局.[02:23] .[02:23] 在漫天风沙里望着你远去.[02:27] 我竟悲伤的不能自已.[02:32] 多盼能送君千里 直到山穷水尽.[02:36] 一生和你相依.[02:42] .[02:43] 多盼能送君千里 直到山穷水尽.[02:50] 一生和你相依


//[00:00]盛夏光年（live）.[00:03]作词：阿信·五月天.[00:04]作曲：阿信·五月天.[00:05]演唱：陈冰.[00:12].[00:14]我骄傲的破坏.[00:17]我痛恨的平凡.[00:19]才想起那些是我最爱.[00:23].[00:24]让盛夏去贪玩.[00:27]把残酷的未来.[00:29]狂放到光年外.[00:34].[00:34]放弃规则 放纵去爱.[00:39]放肆自己 放空未来.[00:44]我不转弯 我不转弯.[00:49]我不转弯 我不转弯.[00:56].[01:14]我要我疯 我要我爱 就是.[01:17]我要我疯 我要我爱.[01:19]一万首的mp3 一万次疯狂的爱.[01:21]灭不了一个渺小的孤单.[01:24].[01:25]我要我疯 我要我爱 就是.[01:27]我要我疯 我要我爱.[01:29]盛夏的一场狂欢 来到了光年之外.[01:32]长大难道是人必经的溃烂.[01:35].[01:36]放弃规则 放纵去爱.[01:40]放肆自己 放空未来.[01:45]我不转弯 我不转弯.[01:50]我不转弯 我不转弯.[01:58].[02:05]我不转弯.[02:15]我不转弯我不 我不转弯我不 我不转弯.[02:25]我不转弯.[02:36]
